cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'cmake'
brew 'coreutils'
brew 'dockutil'
# brew graphviz
brew 'ffmpeg'
brew 'jq'
brew 'go'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'pyenv'
# brew sleuthkit
brew 'unrar'
brew 'wget'
brew 'yarn'

cask '1password'
cask 'alfred'
# cask 'adobe-photoshop-cc'
# cask 'amazon-cloud-drive'
cask 'appcleaner'
# cask 'backblaze'
# cask 'backblaze-downloader'
cask 'bartender'
cask 'bbedit'
# cask 'boom'
cask 'ccleaner'
cask 'cocktail'
cask 'coconutbattery'
cask 'daisydisk'
cask 'dash'
# cask 'deluge'
cask 'docker'
# cask 'evernote'
# cask 'fiddler'
# cask 'filebot'
cask 'filezilla'
cask 'gemini'
cask 'google-chrome'
cask 'handbrake'
cask 'hyperdock'
# cask 'kaleidoscope'
cask 'mactracker'
cask 'mediainfo'
cask 'omnifocus'
cask 'plex-media-player'
cask 'postman'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelbear'
cask 'unetbootin'
cask 'visual-studio-code'
cask 'vlc'